config.org
#+TITLE: Peanutkoa's Config
#+AUTHOR: PeanutKoa
#+DESCRIPTION: My own personal config for GNU Emacs

* TABLE OF CONTENTS :TOC_3:
- [[#package-management-basic-keybinds-other-startup-stuff][Package Management, Basic Keybinds, Other Startup Stuff]]
  - [[#startup-info][Startup Info]]
    - [[#setup][Setup]]
  - [[#straightel-and-use-package][Straight.el and Use-Package]]
    - [[#setup-1][Setup]]
  - [[#meta-settings][Meta Settings]]
    - [[#save-file-changes][Save File Changes]]
    - [[#startup-fullscreen][Startup Fullscreen]]
    - [[#sudo-edit][Sudo Edit]]
    - [[#diminish][Diminish]]
    - [[#app-launcher][App Launcher]]
  - [[#beautifying][Beautifying]]
    - [[#catppuccintheme][Catppuccin/Theme]]
    - [[#rainbow-delimiters][Rainbow Delimiters]]
    - [[#rainbow-mode][Rainbow Mode]]
    - [[#fic-mode][Fic Mode]]
    - [[#font][Font]]
    - [[#line-numbering][Line Numbering]]
    - [[#smoother-scrollingrefresh-display][Smoother Scrolling/Refresh Display]]
    - [[#remove-elements][Remove Elements]]
    - [[#dashboard][Dashboard]]
    - [[#transparency][Transparency]]
  - [[#keybindings][Keybindings]]
    - [[#evil-mode][Evil Mode]]
    - [[#evil-collection][Evil Collection]]
    - [[#electric-pairs][Electric Pairs]]
    - [[#blimpy][Blimpy]]
    - [[#general-setup][General Setup]]
    - [[#globalnon-leader-keybinds][Global/Non-Leader Keybinds]]
- [[#ui-and-vertico][UI and Vertico]]
  - [[#ui][UI]]
    - [[#doom-modeline][Doom Modeline]]
    - [[#which-key][Which-Key]]
    - [[#helpful][Helpful]]
    - [[#jinxspellcheck][Jinx/Spellcheck]]
    - [[#mentorrtorrent][Mentor/RTorrent]]
    - [[#treemacs][Treemacs]]
  - [[#vertico][Vertico]]
    - [[#vertico-1][Vertico]]
    - [[#consult][Consult]]
    - [[#marginalia][Marginalia]]
    - [[#embark][Embark]]
    - [[#orderless][Orderless]]
- [[#org-mode][Org Mode]]
  - [[#beautifying-1][Beautifying]]
    - [[#basic-setup][Basic Setup]]
    - [[#org-modern][Org Modern]]
  - [[#functional][Functional]]
    - [[#toc-org][TOC-Org]]
    - [[#agendatodo][Agenda/TODO]]
- [[#project-management][Project Management]]
  - [[#projectile][Projectile]]
    - [[#setup-2][Setup]]
    - [[#projectile-rgag-integration][Projectile RG/AG Integration]]
  - [[#magit][Magit]]
    - [[#magit-setup][Magit Setup]]
  - [[#dired-config][Dired Config]]
    - [[#nerd-icons][Nerd Icons]]
    - [[#single-buffer-mode][Single Buffer Mode]]
    - [[#dired-open][Dired Open]]
- [[#lsp][LSP]]
  - [[#lsp-mode][LSP-Mode]]
    - [[#lsp-mode-setup][LSP-Mode Setup]]
    - [[#lsp-booster][LSP-Booster]]
    - [[#flycheck][Flycheck]]
  - [[#corfu][Corfu]]
    - [[#corfu-1][Corfu]]
  - [[#languages][Languages]]
    - [[#python][Python]]
    - [[#lua][Lua]]
    - [[#ruby][Ruby]]
    - [[#rust][Rust]]
    - [[#hyprlang][Hyprlang]]
    - [[#markdown][Markdown]]
- [[#terminal-and-shell][Terminal and Shell]]
  - [[#term][Term]]
    - [[#better-term][Better Term]]
    - [[#term-256-color][Term 256 Color]]
    - [[#eat-better-term][EaT (Better Term)]]
  - [[#shell][Shell]]
    - [[#better-eshell][Better eShell]]
- [[#keybindings-leader][Keybindings Leader]]
  - [[#ui-1][UI]]
    - [[#window-w][Window (w)]]
    - [[#buffer-b][Buffer (b)]]
  - [[#actions][Actions]]
    - [[#file-f][File (f)]]
    - [[#magit-m][Magit (m)]]
    - [[#org-o][Org (o)]]
    - [[#misc-non-prefixed][Misc (non-prefixed)]]
- [[#ending-script][Ending Script]]
  - [[#optimization][Optimization]]
    - [[#gc-faster][GC faster]]

* Package Management, Basic Keybinds, Other Startup Stuff

** Startup Info

*** Setup
#+BEGIN_SRC emacs-lisp
  ;; The default is 800 kilobytes.  Measured in bytes.
  (setq gc-cons-threshold (* 50 1000 1000))
  (setq read-process-output-max (* 1024 1024)) ;; 1mb

  (recentf-mode 1)

  (defun efs/display-startup-time ()
    (message "Emacs loaded with %d garbage collections." gcs-done))

  (add-hook 'emacs-startup-hook #'efs/display-startup-time)
#+END_SRC

** Straight.el and Use-Package

*** Setup
#+BEGIN_SRC emacs-lisp
  (defvar bootstrap-version)
  (let ((bootstrap-file
         (expand-file-name
          "straight/repos/straight.el/bootstrap.el"
          (or (bound-and-true-p straight-base-dir)
              user-emacs-directory)))
        (bootstrap-version 7))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))
  (push 'org straight-built-in-pseudo-packages)
  (straight-use-package 'use-package)
#+END_SRC

** Meta Settings

*** Save File Changes
#+BEGIN_SRC emacs-lisp
  (setq auto-save-default nil
        make-backup-files nil
        large-file-warning-threshold nil)
#+END_SRC

*** Startup Fullscreen
#+BEGIN_SRC emacs-lisp
  (add-to-list 'default-frame-alist '(fullscreen . maximized))
#+END_SRC

*** Sudo Edit
#+BEGIN_SRC emacs-lisp
  (use-package sudo-edit
    :straight t)
#+END_SRC

*** Diminish
#+BEGIN_SRC emacs-lisp
  (use-package diminish
    :straight t)
#+END_SRC

*** App Launcher
#+BEGIN_SRC emacs-lisp
  (use-package app-launcher
    :straight '(app-launcher :host github :repo "SebastienWae/app-launcher"))

  (defun emacs-run-launcher ()
    "Creates a Run Launcher similar to KRunner, set to C-M-<SPC>"
    (interactive)
    (with-selected-frame 
      (make-frame '((name . "emacs-run-launcher")
                    (minibuffer . only)
                    (fullscreen . 0) ; no fullscreen
                    (undecorated . t) ; remove title bar
                    (auto-raise . t) ; focus on this frame
                    ;;(tool-bar-lines . 0)
                    ;;(menu-bar-lines . 0)
                    (internal-border-width . 10)
                    (width . 80)
                    (height . 11)))
                    (unwind-protect
                      (app-launcher-run-app)
                      (delete-frame))))
#+END_SRC

** Beautifying

*** Catppuccin/Theme
#+BEGIN_SRC emacs-lisp
  (use-package catppuccin-theme
    :straight t)
  (straight-use-package 'doom-themes)
  (load-theme 'catppuccin :no-confirm)
#+END_SRC

*** Rainbow Delimiters
#+BEGIN_SRC emacs-lisp
  (use-package rainbow-delimiters
    :straight t
    :hook (prog-mode . rainbow-delimiters-mode))
#+END_SRC

*** Rainbow Mode
#+BEGIN_SRC emacs-lisp
  (use-package rainbow-mode
    :straight t
    :hook
    (prog-mode . rainbow-mode)
    (org-mode . rainbow-mode))
#+END_SRC

*** Fic Mode
#+BEGIN_SRC emacs-lisp
  (use-package fic-mode-xtra
    :straight '(fic-mode-xtra :host github :repo "PeanutKoa/fic-mode-xtra")
    :hook (prog-mode . fic-mode))
#+END_SRC

*** Font
#+BEGIN_SRC emacs-lisp
  (set-face-attribute 'default nil :font "JetBrainsMono Nerd Font" :height 120)
#+END_SRC

*** Line Numbering
#+BEGIN_SRC emacs-lisp
  ;;setup
  (column-number-mode)
  (global-display-line-numbers-mode t)
  (setq display-line-numbers-type 'relative)
  ;;turn off for some modes
  (dolist (mode '(org-mode-hook
                  term-mode-hook
                  shell-mode-hook
                  treemacs-mode-hook
                  eshell-mode-hook
  		        eat-mode-hook
  		        woman-mode-hook
  		        eww-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+END_SRC

*** Smoother Scrolling/Refresh Display
#+BEGIN_SRC emacs-lisp
  (setq redisplay-dont-pause t
    scroll-margin 1
    scroll-step 1
    scroll-conservatively 10000
    scroll-preserve-screen-position 1)
#+END_SRC

*** Remove Elements
#+BEGIN_SRC emacs-lisp
  (setq inhibit-startup-message t)
  (setq ring-bell-function 'ignore)
  (scroll-bar-mode -1)
  (menu-bar-mode -1)
  (tool-bar-mode -1)
#+END_SRC

*** Dashboard
#+BEGIN_SRC emacs-lisp

  (use-package nerd-icons
    :straight t
    :custom
    (nerd-icons-font-family "Symbols Nerd Font Mono"))

  (use-package dashboard
    :straight t
    :init
    (setq initial-buffer-choice 'dashboard-open)
    (setq dashboard-display-icons-p t)     ; display icons on both GUI and terminal
    (setq dashboard-icon-type 'nerd-icons) ; use `nerd-icons' package
    (setq dashboard-set-heading-icons t)
    (setq dashboard-set-file-icons t)
    (setq dashboard-center-content t)
    (setq dashboard-projects-backend 'projectile)
    (setq dashboard-banner-logo-title "PeanutKoa's Emacs, Powered by Evil!")
    (setq dashboard-startup-banner "~/.emacs.d/banner.txt") 
    (setq dashboard-items '((recents   . 5)
    			    (bookmarks . 5)
                            (agenda    . 5)
    	                    (projects  . 5)))
    :config
    (dashboard-setup-startup-hook))
#+END_SRC

*** Transparency
#+BEGIN_SRC emacs-lisp
  (add-to-list 'default-frame-alist '(alpha-background . 95))
#+END_SRC

** Keybindings

*** Evil Mode
#+BEGIN_SRC emacs-lisp
  (use-package evil
    :straight t
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-want-C-u-scroll t)
    (setq evil-want-C-i-jump nil)
    :config
    (evil-mode 1)
    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)

    ;; Use visual line motions even outside of visual-line-mode buffers
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal))
  (setq-default indent-tabs-mode nil)
  (setq-default tab-width 4)
#+END_SRC

*** Evil Collection
#+BEGIN_SRC emacs-lisp
  (use-package evil-collection
    :straight t
    :after evil
    :config
    (evil-collection-init))
#+END_SRC

*** Electric Pairs
#+BEGIN_SRC emacs-lisp
  (electric-pair-mode +1)
#+END_SRC

*** Blimpy
#+BEGIN_SRC emacs-lisp
    (use-package blimpy
      :straight (blimpy :host github :repo "progfolio/blimpy")
      :after (evil)
      :config
      (add-hook 'blimpy-before-typing-the-word-blimpy-in-emacs-hook
                (apply-partially #'evil-insert 1)))
#+END_SRC

*** General Setup
#+BEGIN_SRC emacs-lisp
    (use-package general
      :straight t
      :after evil
      :config
      (general-evil-setup)
      (general-create-definer pkoa/leader
      :states '(normal insert visual emacs)
      :prefix "SPC"
      :non-normal-prefix "C-SPC"))
    (use-package hydra
      :straight t)
#+END_SRC

*** Global/Non-Leader Keybinds
#+BEGIN_SRC emacs-lisp
  (general-define-key
   "C-x M-x" 'redraw-display
   "<escape>" 'keyboard-escape-quit)
#+END_SRC

* UI and Vertico

