config.el
;; The default is 800 kilobytes.  Measured in bytes.
(setq gc-cons-threshold (* 50 1000 1000))
(setq read-process-output-max (* 1024 1024)) ;; 1mb

(recentf-mode 1)

(defun efs/display-startup-time ()
  (message "Emacs loaded with %d garbage collections." gcs-done))

(add-hook 'emacs-startup-hook #'efs/display-startup-time)

(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name
        "straight/repos/straight.el/bootstrap.el"
        (or (bound-and-true-p straight-base-dir)
            user-emacs-directory)))
      (bootstrap-version 7))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))
(push 'org straight-built-in-pseudo-packages)
(straight-use-package 'use-package)

(setq auto-save-default nil
      make-backup-files nil
      large-file-warning-threshold nil)

(add-to-list 'default-frame-alist '(fullscreen . maximized))

(use-package sudo-edit
  :straight t)

(use-package diminish
  :straight t)

(use-package app-launcher
  :straight '(app-launcher :host github :repo "SebastienWae/app-launcher"))

(defun emacs-run-launcher ()
  "Creates a Run Launcher similar to KRunner, set to C-M-<SPC>"
  (interactive)
  (with-selected-frame 
    (make-frame '((name . "emacs-run-launcher")
                  (minibuffer . only)
                  (fullscreen . 0) ; no fullscreen
                  (undecorated . t) ; remove title bar
                  (auto-raise . t) ; focus on this frame
                  ;;(tool-bar-lines . 0)
                  ;;(menu-bar-lines . 0)
                  (internal-border-width . 10)
                  (width . 80)
                  (height . 11)))
                  (unwind-protect
                    (app-launcher-run-app)
                    (delete-frame))))

(use-package catppuccin-theme
  :straight t)
(straight-use-package 'doom-themes)
(load-theme 'catppuccin :no-confirm)

(use-package rainbow-delimiters
  :straight t
  :hook (prog-mode . rainbow-delimiters-mode))

(use-package rainbow-mode
  :straight t
  :hook
  (prog-mode . rainbow-mode)
  (org-mode . rainbow-mode))

(use-package fic-mode-xtra
  :straight '(fic-mode-xtra :host github :repo "PeanutKoa/fic-mode-xtra")
  :hook (prog-mode . fic-mode))

(set-face-attribute 'default nil :font "JetBrainsMono Nerd Font" :height 120)

;;setup
(column-number-mode)
(global-display-line-numbers-mode t)
(setq display-line-numbers-type 'relative)
;;turn off for some modes
(dolist (mode '(org-mode-hook
                term-mode-hook
                shell-mode-hook
                treemacs-mode-hook
                eshell-mode-hook
		        eat-mode-hook
		        woman-mode-hook
		        eww-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))

(setq redisplay-dont-pause t
  scroll-margin 1
  scroll-step 1
  scroll-conservatively 10000
  scroll-preserve-screen-position 1)

(setq inhibit-startup-message t)
(setq ring-bell-function 'ignore)
(scroll-bar-mode -1)
(menu-bar-mode -1)
(tool-bar-mode -1)

(use-package nerd-icons
  :straight t
  :custom
  (nerd-icons-font-family "Symbols Nerd Font Mono"))

(use-package dashboard
  :straight t
  :init
  (setq initial-buffer-choice 'dashboard-open)
  (setq dashboard-display-icons-p t)     ; display icons on both GUI and terminal
  (setq dashboard-icon-type 'nerd-icons) ; use `nerd-icons' package
  (setq dashboard-set-heading-icons t)
  (setq dashboard-set-file-icons t)
  (setq dashboard-center-content t)
  (setq dashboard-projects-backend 'projectile)
  (setq dashboard-banner-logo-title "PeanutKoa's Emacs, Powered by Evil!")
  (setq dashboard-startup-banner "~/.emacs.d/banner.txt") 
  (setq dashboard-items '((recents   . 5)
  			    (bookmarks . 5)
                          (agenda    . 5)
  	                    (projects  . 5)))
  :config
  (dashboard-setup-startup-hook))

(add-to-list 'default-frame-alist '(alpha-background . 95))

(use-package evil
  :straight t
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-want-C-u-scroll t)
  (setq evil-want-C-i-jump nil)
  :config
  (evil-mode 1)
  (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)

  ;; Use visual line motions even outside of visual-line-mode buffers
  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

  (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard-mode 'normal))
(setq-default indent-tabs-mode nil)
(setq-default tab-width 4)

(use-package evil-collection
  :straight t
  :after evil
  :config
  (evil-collection-init))

(electric-pair-mode +1)

(use-package blimpy
  :straight (blimpy :host github :repo "progfolio/blimpy")
  :after (evil)
  :config
  (add-hook 'blimpy-before-typing-the-word-blimpy-in-emacs-hook
            (apply-partially #'evil-insert 1)))

(use-package general
  :straight t
  :after evil
  :config
  (general-evil-setup)
  (general-create-definer pkoa/leader
  :states '(normal insert visual emacs)
  :prefix "SPC"
  :non-normal-prefix "C-SPC"))
(use-package hydra
  :straight t)

(general-define-key
 "C-x M-x" 'redraw-display
 "<escape>" 'keyboard-escape-quit)
