config.el

(use-package doom-modeline
  :straight t
  :init (doom-modeline-mode 1))

(which-key-mode 1)
(setq which-key-idle-delay -1)

(use-package helpful
  :straight t
  :bind (("C-h f" . helpful-callable)
	 ("C-h v" . helpful-variable)
	 ("C-h k"    .   helpful-key)
	 ("C-h x"  . helpful-command)))

(use-package jinx
  :straight t
  :bind (("M-$" . jinx-correct)
       ("C-M-$" . jinx-languages)))

(use-package mentor
  :straight t)

(use-package treemacs
  :straight t
  :config
  (setq treemacs-position 'right)
  :defer t)

(use-package treemacs-evil
  :after (treemacs evil)
  :straight t)

(use-package treemacs-projectile
  :after (treemacs projectile)
  :straight t)

(use-package treemacs-magit
  :after (treemacs magit)
  :straight t)

(use-package treemacs-nerd-icons
  :straight t
  :after treemacs
  :config
  (treemacs-load-theme "nerd-icons"))

(use-package vertico
  :straight t
  :custom
  (vertico-cycle t)
  :bind
  (:map vertico-map
  	("C-j" . vertico-next)
  	("C-k" . vertico-previous))
  :init
  (vertico-mode))

(use-package consult
  :straight t)

(use-package marginalia
  :straight t
  :bind (:map minibuffer-local-map
         ("M-A" . marginalia-cycle))
  :init
  (marginalia-mode))

(use-package nerd-icons-completion
  :straight t
  :after marginalia
  :config
  (nerd-icons-completion-mode)
  (add-hook 'marginalia-mode-hook #'nerd-icons-completion-marginalia-setup))

(use-package embark
  :straight t
  :bind
  (("C-SPC" . embark-act)         ;; pick some comfortable binding
   ("C-M-SPC" . embark-dwim)        ;; good alternative: M-.
   ("C-h B" . embark-bindings)) ;; alternative for `describe-bindings'
  :custom
  (embark-indicators '(embark-minimal-indicator
                       embark-highlight-indicator
                       embark-isearch-highlight-indicator))
  :init
  (setq prefix-help-command #'embark-prefix-help-command)
  (add-hook 'context-menu-functions #'embark-context-menu 100)
  :config
  (add-to-list 'display-buffer-alist
               '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                 nil
                 (window-parameters (mode-line-format . none)))))

(use-package embark-consult
  :straight t
  :hook
  (embark-collect-mode . consult-preview-at-point-mode))

(use-package orderless
  :straight t
  :custom
  (completion-styles '(orderless basic))
  (completion-category-overrides '((file (styles partial-completion))))
  (completion-category-defaults nil) 
  (completion-pcm-leading-wildcard t))

(defun pkoa/hyphen-dot ()
  ;; Replace list hyphen with dot
  (font-lock-add-keywords 'org-mode
                          '(("^ *\\([-]\\) "
                             (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•")))))))

(use-package org
  :hook (org-mode . visual-line-mode)
  :config
  (pkoa/hyphen-dot))
(setq org-hide-emphasis-markers t
	org-ellipsis "…")

(use-package org-modern
  :straight t
  :init
  (global-org-modern-mode))
(setq org-modern-fold-stars '(("◉" . "◉") ("○" . "○") ("✸" . "✸") ("✱" . "✱") ("✿" . "✿") ("◉" . "◉") ("○" . "○") ("✸" . "✸") ("✱" . "✱") ("✿" . "✿")))

(use-package toc-org
  :straight t
  :hook (org-mode . toc-org-mode))

(use-package org
  :custom
  (org-agenda-files '("~/Documents/org_agenda/")))

(use-package projectile
  :straight t
  :diminish projectile-mode
  :config (projectile-mode)
  :custom ((projectile-completion-system 'default))
  :bind-keymap
  ("C-c p" . projectile-command-map))

(use-package rg
  :straight t)

(use-package ag
  :straight t)

(use-package magit
  :straight t
  :commands magit-status)

(use-package nerd-icons-dired
  :straight t
  :hook (dired-mode . nerd-icons-dired-mode))

(use-package dired-single
  :straight t)

(use-package dired-open
  :straight t
  :config
  (setq dired-open-extensions '(("gif"  .  "gwenview")
				                ("jpg"  .  "gwenview")
				                ("png"  .  "gwenview")
				                ("mov"  .    "haruna")
				                ("mp4"  .    "haruna")
				                ("mkv"  .    "haruna")
				                ("mp3"  . "audacious")
                                ("flac" . "audacious")
				                ("ogg"  . "audacious")
				                ("acm"  . "audacious")
				                ("wav"  . "audacious"))))

(use-package lsp-mode
  :after markdown-mode
  :init
  ;; set prefix for lsp-command-keymap (few alternatives - "C-l", "C-c l")
  (setq lsp-keymap-prefix "C-c l")
  :hook ((python-ts-mode . lsp-deferred)
	     (rust-mode . lsp-deferred)
         (lsp-mode . lsp-enable-which-key-integration))
  :commands (lsp lsp-deferred))

(use-package consult-lsp
  :straight '(consult-lsp :host github :repo "gagbo/consult-lsp")
  :after lsp-mode)

(use-package lsp-treemacs
  :straight t
  :after lsp-mode)

(use-package lsp-ui
  :straight t
  :after lsp-mode
  :commands lsp-ui-mode)

(defun lsp-booster--advice-json-parse (old-fn &rest args)
  "Try to parse bytecode instead of json."
  (or
   (when (equal (following-char) ?#)
     (let ((bytecode (read (current-buffer))))
       (when (byte-code-function-p bytecode)
         (funcall bytecode))))
   (apply old-fn args)))
(advice-add (if (progn (require 'json)
                       (fboundp 'json-parse-buffer))
                'json-parse-buffer
              'json-read)
            :around
            #'lsp-booster--advice-json-parse)

(defun lsp-booster--advice-final-command (old-fn cmd &optional test?)
  "Prepend emacs-lsp-booster command to lsp CMD."
  (let ((orig-result (funcall old-fn cmd test?)))
    (if (and (not test?)                             ;; for check lsp-server-present?
             (not (file-remote-p default-directory)) ;; see lsp-resolve-final-command, it would add extra shell wrapper
             lsp-use-plists
             (not (functionp 'json-rpc-connection))  ;; native json-rpc
             (executable-find "emacs-lsp-booster"))
        (progn
          (when-let ((command-from-exec-path (executable-find (car orig-result))))  ;; resolve command from exec-path (in case not found in $PATH)
            (setcar orig-result command-from-exec-path))
          (message "Using emacs-lsp-booster for %s!" orig-result)
          (cons "emacs-lsp-booster" orig-result))
      orig-result)))
(advice-add 'lsp-resolve-final-command :around #'lsp-booster--advice-final-command)

(use-package flycheck
  :straight t
  :hook (prog-mode . flycheck-mode))
(use-package yasnippet
  :straight t
  :hook ((lsp-mode . yas-minor-mode)))
