config.org
*** Corfu
#+BEGIN_SRC emacs-lisp
  (use-package corfu
    :straight t
    :custom
    (corfu-min-width 60)
    (corfu-max-width corfu-min-width)
    (corfu-count 14)
    (corfu-auto t)
    (corfu-auto-prefix 2)
    (corfu-auto-delay 0.05)
    (corfu-cycle t)
    :bind
    (:map corfu-map ("s-SPC" . corfu-insert-separator))
    :init
    (global-corfu-mode)
    (corfu-popupinfo-mode))
  (setq lsp-completion-provider :none)
  (defun corfu-lsp-setup ()
    (setq-local completion-styles '(orderless)
                completion-category-defaults nil))
  (add-hook 'lsp-mode-hook #'corfu-lsp-setup)

  (use-package nerd-icons-corfu
    :straight t
    :after corfu
    :config
    (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter))

  (use-package emacs
    :custom
    (tab-always-indent 'complete)
    (context-menu-mode t)
    (enable-recursive-minibuffers t)
    (read-extended-command-predicate #'command-completion-default-include-p))
#+END_SRC

** Languages

*** Python
#+BEGIN_SRC emacs-lisp
  (setq major-mode-remap-alist
        '((python-mode . python-ts-mode)))
#+end_SRC

*** Lua
#+BEGIN_SRC emacs-lisp
  (use-package lua-mode
    :straight t)
#+END_SRC

*** Ruby
#+BEGIN_SRC emacs-lisp
  (use-package rspec-mode
    :straight t)
  (use-package inf-ruby
    :straight t)
#+END_SRC

*** Rust
#+BEGIN_SRC emacs-lisp
  (use-package rust-mode
    :straight t
    :init
    (setq rust-mode-treesitter-derive t))

#+END_SRC

*** Hyprlang
#+BEGIN_SRC emacs-lisp
  (use-package hyprlang-ts-mode
    :straight t)
  (add-to-list 'treesit-language-source-alist
  	     '(hyprlang "https://github.com/tree-sitter-grammars/tree-sitter-hyprlang"))
#+END_SRC

*** Markdown
#+BEGIN_SRC emacs-lisp
  (use-package markdown-mode
    :straight t)
#+END_SRC

* Terminal and Shell

** Term

*** Better Term
#+BEGIN_SRC emacs-lisp
  (use-package term
    :commands term
    :config
    (setq explicit-shell-file-name "bash") ;; Change this to zsh, etc
    ;;(setq explicit-zsh-args '())         ;; Use 'explicit-<shell>-args for shell-specific args
    
    ;; Match the default Bash shell prompt.  Update this if you have a custom prompt
    (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *"))
#+END_SRC

*** Term 256 Color
#+BEGIN_SRC emacs-lisp
  (use-package eterm-256color
    :straight t
    :hook (term-mode . eterm-256color-mode))
#+END_SRC

*** EaT (Better Term)
#+BEGIN_SRC emacs-lisp
    (straight-use-package
     '(eat :type git
           :host codeberg
           :repo "akib/emacs-eat"
           :files ("*.el" ("term" "term/*.el") "*.texi"
                   "*.ti" ("terminfo/e" "terminfo/e/*")
                   ("terminfo/65" "terminfo/65/*")
                   ("integration" "integration/*")
                   (:exclude ".dir-locals.el" "*-tests.el"))
           :hook (eshell-load . eat-eshell-mode)))
#+END_SRC

** Shell

*** Better eShell
#+BEGIN_SRC emacs-lisp

  (defun efs/configure-eshell ()
    ;; Save command history when commands are entered
    (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)
    
    ;; Truncate buffer for performance
    (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)
    
    ;; Bind some useful keys for evil-mode
    (evil-define-key '(normal insert visual) eshell-mode-map (kbd "<home>") 'beginning-of-line)
    (evil-normalize-keymaps)
    
    (setq eshell-history-size         10000
          eshell-buffer-maximum-lines 10000
          eshell-hist-ignoredups t
          eshell-scroll-to-bottom-on-input t))

  (use-package eshell-git-prompt
    :straight t
    :after eshell)

  (use-package eshell-z
    :straight t
    :after eshell)

  (use-package esh-help
    :straight t
    :after eshell
    :config (setup-esh-help-eldoc))

  (use-package eshell
    :hook (eshell-first-time-mode . efs/configure-eshell)
    :config

    (with-eval-after-load 'esh-opt
      (setq eshell-destroy-buffer-when-process-dies t)
      (setq eshell-visual-commands '("htop" "nvim" "gdu")))
    
    (eshell-git-prompt-use-theme 'multiline2))

#+END_SRC

* Keybindings Leader

** UI

*** Window (w)
#+BEGIN_SRC emacs-lisp
  (pkoa/leader
    "w" '(:ignore t :which-key "Window")
    "wd" '(delete-window :which-key "Delete Window")
    "wv" '(evil-window-vsplit :which-key "Split Vertically")
    "ws" '(evil-window-split :which-key "Split Horizontally")
    "wh" '(evil-window-left :which-key "Switch Window Left")
    "wl" '(evil-window-right :which-key "Switch Window Right")
    "wk" '(evil-window-up :which-key "Switch Window Up")
    "wj" '(evil-window-down :which-key "Switch Window Down")
    "ww" '(evil-window-next :which-key "Next Window")
    "wr" '(redraw-display :which-key "Refresh Window/Display")
    "wi" '(delete-other-windows :which-key "Isolate Window"))
#+END_SRC

*** Buffer (b)
#+BEGIN_SRC emacs-lisp
  (pkoa/leader
   "b" '(:ignore t :which-key "Buffer")
   "bc" '(recenter :which-key "Center on Cursor")
   "bw" '(save-buffer :which-key "Save Current Buffer")
   "bd" '(kill-buffer :which-key "Kill Current Buffer")
   "bs" '(consult-buffer :which-key "Switch Buffer"))
#+END_SRC

** Actions

*** File (f)
#+BEGIN_SRC emacs-lisp
  (pkoa/leader
    "f" '(:ignore t :which-key "File")
    "ff" '(find-file :which-key "Find File")
    "fF" '(consult-fd :wich-key "Fd")
    "fP" '((lambda () (interactive)
  	 (find-file "~/.emacs.d/config.org"))
  	 :which-key "Emacs config.org")
    "fg" '(consult-ripgrep :which-key "RipGrep")
    "fG" '(ag :which-key "Silver-Searcher")
    "fe" '(eval-last-sexp :which-key "evaluate")
    "fs" '(consult-line :which-key "Search File")
    "fw" '(write-file :which-key "Write File to...")
    "fr" '(consult-recent-file :which-key "Recent Files")
    "fu" '(sudo-edit-find-file :j which-key "Sudo Find File")
    "fU" '(sudo-edit :which-key "Sudo Edit File"))
#+END_SRC 

*** Magit (m)
#+BEGIN_SRC emacs-lisp
  (pkoa/leader
    "m" '(:ignore t :which-key "Magit")
    "mm" '(magit-status :which-key "Magit Status")
    "md" '(magit-dispatch :which-key "Dispatch")
    "mf" '(with-editor-finish :which-key "Confirm")
    "ms" '(magit-stage-modified :which-key "Stage")
    "mS" '(magit-unstage-all :which-key "Unstage")
    "mc" '(magit-commit :which-key "Commit")
    "mp" '(magit-push :which-key "Push")
    "mP" '(magit-pull :which-key "Pull"))
#+END_SRC


*** Org (o)
#+BEGIN_SRC emacs-lisp
      (pkoa/leader
        "o" '(:ignore t :which-key "Org")
        "oa" '(org-agenda :which-key "Agenda")
        "ot" '(org-todo :which-key "Todo")
        "ol" '(org-insert-link :which-key "Insert Link")
        "oo" '(org-open-at-point :which-key "Open")
        "oi" '(org-set-tags-command :which-key "Set Tags"))
#+END_SRC

*** Misc (non-prefixed)
#+BEGIN_SRC emacs-lisp
  (pkoa/leader
    "SPC" '(execute-extended-command :which-key "M-x"))
#+END_SRC

* Ending Script

** Optimization

*** GC faster
#+BEGIN_SRC emacs-lisp
  (setq gc-cons-threshold (* 2 1000 1000))
#+END_SRC
